g4klx/MMDVM/STM32F7XX_Lib/STM32F7xx_StdPeriph_Driver/inc/stm32f7xx_tim.h
#define TIM_CounterMode_Up                 ((uint32_t)0x0000)
#define TIM_CounterMode_Down               (TIM_CR1_DIR)
#define TIM_CounterMode_CenterAligned1     (TIM_CR1_CMS_0)
#define TIM_CounterMode_CenterAligned2     (TIM_CR1_CMS_1)
#define TIM_CounterMode_CenterAligned3     (TIM_CR1_CMS)
#define IS_TIM_COUNTER_MODE(MODE) (((MODE) == TIM_CounterMode_Up) ||  \
                                   ((MODE) == TIM_CounterMode_Down) || \
                                   ((MODE) == TIM_CounterMode_CenterAligned1) || \
                                   ((MODE) == TIM_CounterMode_CenterAligned2) || \
                                   ((MODE) == TIM_CounterMode_CenterAligned3))
/**
  * @}
  */

/** @defgroup TIM_Output_Compare_Polarity 
  * @{
  */

#define TIM_OCPolarity_High                ((uint32_t)0x0000)
#define TIM_OCPolarity_Low                 (TIM_CCER_CC1P)
#define IS_TIM_OC_POLARITY(POLARITY) (((POLARITY) == TIM_OCPolarity_High) || \
                                      ((POLARITY) == TIM_OCPolarity_Low))
/**
  * @}
  */

/** @defgroup TIM_Output_Compare_N_Polarity 
  * @{
  */
  
#define TIM_OCNPolarity_High               ((uint32_t)0x0000)
#define TIM_OCNPolarity_Low                (TIM_CCER_CC1NP)
#define IS_TIM_OCN_POLARITY(POLARITY) (((POLARITY) == TIM_OCNPolarity_High) || \
                                       ((POLARITY) == TIM_OCNPolarity_Low))
/**
  * @}
  */

/** @defgroup TIM_Output_Compare_State 
  * @{
  */

#define TIM_OutputState_Disable            ((uint32_t)0x0000)
#define TIM_OutputState_Enable             (TIM_CCER_CC1E)
#define IS_TIM_OUTPUT_STATE(STATE) (((STATE) == TIM_OutputState_Disable) || \
                                    ((STATE) == TIM_OutputState_Enable))
/**
  * @}
  */ 


/** @defgroup TIM_Output_Compare_N_State
  * @{
  */

#define TIM_OutputNState_Disable           ((uint32_t)0x0000)
#define TIM_OutputNState_Enable            (TIM_CCER_CC1NE)
#define IS_TIM_OUTPUTN_STATE(STATE) (((STATE) == TIM_OutputNState_Disable) || \
                                     ((STATE) == TIM_OutputNState_Enable))
/**
  * @}
  */ 

/** @defgroup TIM_Capture_Compare_State
  * @{
  */

#define TIM_CCx_Enable                      ((uint32_t)0x0001)
#define TIM_CCx_Disable                     ((uint32_t)0x0000)
#define IS_TIM_CCX(CCX) (((CCX) == TIM_CCx_Enable) || \
                         ((CCX) == TIM_CCx_Disable))
/**
  * @}
  */ 

/** @defgroup TIM_Capture_Compare_N_State
  * @{
  */

#define TIM_CCxN_Enable                     ((uint32_t)0x0004)
#define TIM_CCxN_Disable                    ((uint32_t)0x0000)
#define IS_TIM_CCXN(CCXN) (((CCXN) == TIM_CCxN_Enable) || \
                           ((CCXN) == TIM_CCxN_Disable))
/**
  * @}
  */ 

/** @defgroup TIM_Break_Input_enable_disable 
  * @{
  */

#define TIM_Break_Enable                   (TIM_BDTR_BKE)
#define TIM_Break_Disable                  ((uint32_t)0x0000)
#define IS_TIM_BREAK_STATE(STATE) (((STATE) == TIM_Break_Enable) || \
                                   ((STATE) == TIM_Break_Disable))
/**
  * @}
  */ 

/** @defgroup TIM_Break1_Input_enable_disable 
  * @{
  */

#define TIM_Break1_Enable                   (TIM_BDTR_BKE)
#define TIM_Break1_Disable                  ((uint32_t)0x00000000)
#define IS_TIM_BREAK1_STATE(STATE) (((STATE) == TIM_Break1_Enable) || \
                                   ((STATE) == TIM_Break1_Disable))
/**
  * @}
  */

/** @defgroup TIM_Break2_Input_enable_disable 
  * @{
  */

#define TIM_Break2_Enable                   (TIM_BDTR_BK2E)
#define TIM_Break2_Disable                  ((uint32_t)0x00000000)
#define IS_TIM_BREAK2_STATE(STATE) (((STATE) == TIM_Break2_Enable) || \
                                   ((STATE) == TIM_Break2_Disable))
/**
  * @}
  */

/** @defgroup TIM_Break_Polarity 
  * @{
  */

#define TIM_BreakPolarity_Low              ((uint32_t)0x0000)
#define TIM_BreakPolarity_High             (TIM_BDTR_BKP)
#define IS_TIM_BREAK_POLARITY(POLARITY) (((POLARITY) == TIM_BreakPolarity_Low) || \
                                         ((POLARITY) == TIM_BreakPolarity_High))
/**
  * @}
  */ 

/** @defgroup TIM_Break1_Polarity 
  * @{
  */

#define TIM_Break1Polarity_Low              ((uint32_t)0x00000000)
#define TIM_Break1Polarity_High             (TIM_BDTR_BKP)
#define IS_TIM_BREAK1_POLARITY(POLARITY) (((POLARITY) == TIM_Break1Polarity_Low) || \
                                         ((POLARITY) == TIM_Break1Polarity_High))
/**
  * @}
  */ 

/** @defgroup TIM_Break2_Polarity 
  * @{
  */

#define TIM_Break2Polarity_Low              ((uint32_t)0x00000000)
#define TIM_Break2Polarity_High             (TIM_BDTR_BK2P)
#define IS_TIM_BREAK2_POLARITY(POLARITY) (((POLARITY) == TIM_Break2Polarity_Low) || \
                                         ((POLARITY) == TIM_Break2Polarity_High))
/**
  * @}
  */ 

/** @defgroup TIM_Break1_Filter 
  * @{
  */

#define IS_TIM_BREAK1_FILTER(FILTER) ((FILTER) <= 0xF)
/**
  * @}
  */ 

/** @defgroup TIM_Break2_Filter 
  * @{
  */

#define IS_TIM_BREAK2_FILTER(FILTER) ((FILTER) <= 0xF)
/**
  * @}
  */ 

/** @defgroup TIM_AOE_Bit_Set_Reset 
  * @{
  */

#define TIM_AutomaticOutput_Enable         (TIM_BDTR_AOE)
#define TIM_AutomaticOutput_Disable        ((uint32_t)0x0000)
#define IS_TIM_AUTOMATIC_OUTPUT_STATE(STATE) (((STATE) == TIM_AutomaticOutput_Enable) || \
                                              ((STATE) == TIM_AutomaticOutput_Disable))
/**
  * @}
  */ 

/** @defgroup TIM_Lock_level
  * @{
  */

#define TIM_LOCKLevel_OFF                  ((uint32_t)0x0000)
#define TIM_LOCKLevel_1                    (TIM_BDTR_LOCK_0)
#define TIM_LOCKLevel_2                    (TIM_BDTR_LOCK_1)
#define TIM_LOCKLevel_3                    (TIM_BDTR_LOCK)
#define IS_TIM_LOCK_LEVEL(LEVEL) (((LEVEL) == TIM_LOCKLevel_OFF) || \
                                  ((LEVEL) == TIM_LOCKLevel_1) || \
                                  ((LEVEL) == TIM_LOCKLevel_2) || \
                                  ((LEVEL) == TIM_LOCKLevel_3))
/**
  * @}
  */ 

/** @defgroup TIM_OSSI_Off_State_Selection_for_Idle_mode_state 
  * @{
  */

#define TIM_OSSIState_Enable               (TIM_BDTR_OSSI)
#define TIM_OSSIState_Disable              ((uint32_t)0x0000)
#define IS_TIM_OSSI_STATE(STATE) (((STATE) == TIM_OSSIState_Enable) || \
                                  ((STATE) == TIM_OSSIState_Disable))
/**
  * @}
  */

