g4klx/MMDVM/STM32F7XX_Lib/STM32F7xx_StdPeriph_Driver/inc/stm32f7xx_tim.h
/** @defgroup TIM_OSSR_Off_State_Selection_for_Run_mode_state
  * @{
  */

#define TIM_OSSRState_Enable               (TIM_BDTR_OSSR)
#define TIM_OSSRState_Disable              ((uint32_t)0x0000)
#define IS_TIM_OSSR_STATE(STATE) (((STATE) == TIM_OSSRState_Enable) || \
                                  ((STATE) == TIM_OSSRState_Disable))
/**
  * @}
  */ 

/** @defgroup TIM_Output_Compare_Idle_State 
  * @{
  */

#define TIM_OCIdleState_Set                (TIM_CR2_OIS1)
#define TIM_OCIdleState_Reset              ((uint32_t)0x0000)
#define IS_TIM_OCIDLE_STATE(STATE) (((STATE) == TIM_OCIdleState_Set) || \
                                    ((STATE) == TIM_OCIdleState_Reset))
/**
  * @}
  */ 

/** @defgroup TIM_Output_Compare_N_Idle_State 
  * @{
  */

#define TIM_OCNIdleState_Set               (TIM_CR2_OIS1N)
#define TIM_OCNIdleState_Reset             ((uint32_t)0x0000)
#define IS_TIM_OCNIDLE_STATE(STATE) (((STATE) == TIM_OCNIdleState_Set) || \
                                     ((STATE) == TIM_OCNIdleState_Reset))
/**
  * @}
  */ 
    
/** @defgroup TIM_Input_Capture_Polarity 
  * @{
  */

#define  TIM_ICPolarity_Rising             ((uint32_t)0x00000000)
#define  TIM_ICPolarity_Falling            (TIM_CCER_CC1P) 
#define  TIM_ICPolarity_BothEdge           (TIM_CCER_CC1P | TIM_CCER_CC1NP)
#define IS_TIM_IC_POLARITY(POLARITY) (((POLARITY) == TIM_ICPolarity_Rising) || \
                                      ((POLARITY) == TIM_ICPolarity_Falling)|| \
                                      ((POLARITY) == TIM_ICPolarity_BothEdge))
/**
  * @}
  */

/** @defgroup TIM_Input_Capture_Selection 
  * @{
  */

#define TIM_ICSelection_DirectTI           (TIM_CCMR1_CC1S_0) /*!< TIM Input 1, 2, 3 or 4 is selected to be 
                                                                   connected to IC1, IC2, IC3 or IC4, respectively */
#define TIM_ICSelection_IndirectTI         (TIM_CCMR1_CC1S_1) /*!< TIM Input 1, 2, 3 or 4 is selected to be
                                                                   connected to IC2, IC1, IC4 or IC3, respectively. */
#define TIM_ICSelection_TRC                (TIM_CCMR1_CC1S)   /*!< TIM Input 1, 2, 3 or 4 is selected to be connected to TRC. */
#define IS_TIM_IC_SELECTION(SELECTION) (((SELECTION) == TIM_ICSelection_DirectTI) || \
                                        ((SELECTION) == TIM_ICSelection_IndirectTI) || \
                                        ((SELECTION) == TIM_ICSelection_TRC))
/**
  * @}
  */ 

/** @defgroup TIM_Input_Capture_Prescaler 
  * @{
  */

#define TIM_ICPSC_DIV1                     ((uint32_t)0x0000) /*!< Capture performed each time an edge is detected on the capture input. */
#define TIM_ICPSC_DIV2                     (TIM_CCMR1_IC1PSC_0) /*!< Capture performed once every 2 events. */
#define TIM_ICPSC_DIV4                     (TIM_CCMR1_IC1PSC_1) /*!< Capture performed once every 4 events. */
#define TIM_ICPSC_DIV8                     (TIM_CCMR1_IC1PSC) /*!< Capture performed once every 8 events. */
#define IS_TIM_IC_PRESCALER(PRESCALER) (((PRESCALER) == TIM_ICPSC_DIV1) || \
                                        ((PRESCALER) == TIM_ICPSC_DIV2) || \
                                        ((PRESCALER) == TIM_ICPSC_DIV4) || \
                                        ((PRESCALER) == TIM_ICPSC_DIV8))
/**
  * @}
  */ 

/** @defgroup TIM_interrupt_sources 
  * @{
  */

#define TIM_IT_Update                      (TIM_DIER_UIE)
#define TIM_IT_CC1                         (TIM_DIER_CC1IE)
#define TIM_IT_CC2                         (TIM_DIER_CC2IE)
#define TIM_IT_CC3                         (TIM_DIER_CC3IE)
#define TIM_IT_CC4                         (TIM_DIER_CC4IE)
#define TIM_IT_COM                         (TIM_DIER_COMIE)
#define TIM_IT_Trigger                     (TIM_DIER_TIE)
#define TIM_IT_Break                       (TIM_DIER_BIE)
#define IS_TIM_IT(__IT__) ((((__IT__) & 0xFFFFFF00) == 0x00000000) && ((__IT__) != 0x00000000))

#define IS_TIM_GET_IT(IT) (((IT) == TIM_IT_Update) || \
                           ((IT) == TIM_IT_CC1) || \
                           ((IT) == TIM_IT_CC2) || \
                           ((IT) == TIM_IT_CC3) || \
                           ((IT) == TIM_IT_CC4) || \
                           ((IT) == TIM_IT_COM) || \
                           ((IT) == TIM_IT_Trigger) || \
                           ((IT) == TIM_IT_Break))
/**
  * @}
  */ 

/** @defgroup TIM_DMA_Base_address 
  * @{
  */

#define TIM_DMABase_CR1                    (0x00000000)
#define TIM_DMABase_CR2                    (TIM_DCR_DBA_0)
#define TIM_DMABase_SMCR                   (TIM_DCR_DBA_1)
#define TIM_DMABase_DIER                   (TIM_DCR_DBA_1 | TIM_DCR_DBA_0)
#define TIM_DMABase_SR                     (TIM_DCR_DBA_2)
#define TIM_DMABase_EGR                    (TIM_DCR_DBA_2 | TIM_DCR_DBA_0)
#define TIM_DMABase_CCMR1                  (TIM_DCR_DBA_2 | TIM_DCR_DBA_1)
#define TIM_DMABase_CCMR2                  (TIM_DCR_DBA_2 | TIM_DCR_DBA_1 | TIM_DCR_DBA_0)
#define TIM_DMABase_CCER                   (TIM_DCR_DBA_3)
#define TIM_DMABase_CNT                    (TIM_DCR_DBA_3 | TIM_DCR_DBA_0)
#define TIM_DMABase_PSC                    (TIM_DCR_DBA_3 | TIM_DCR_DBA_1)
#define TIM_DMABase_ARR                    (TIM_DCR_DBA_3 | TIM_DCR_DBA_1 | TIM_DCR_DBA_0)
#define TIM_DMABase_RCR                    (TIM_DCR_DBA_3 | TIM_DCR_DBA_2)
#define TIM_DMABase_CCR1                   (TIM_DCR_DBA_3 | TIM_DCR_DBA_2 | TIM_DCR_DBA_0)
#define TIM_DMABase_CCR2                   (TIM_DCR_DBA_3 | TIM_DCR_DBA_2 | TIM_DCR_DBA_1)
#define TIM_DMABase_CCR3                   (TIM_DCR_DBA_3 | TIM_DCR_DBA_2 | TIM_DCR_DBA_1 | TIM_DCR_DBA_0)
#define TIM_DMABase_CCR4                   (TIM_DCR_DBA_4)
#define TIM_DMABase_BDTR                   (TIM_DCR_DBA_4 | TIM_DCR_DBA_0)
#define TIM_DMABase_DCR                    (TIM_DCR_DBA_4 | TIM_DCR_DBA_1)
#define TIM_DMABase_OR                     (TIM_DCR_DBA_4 | TIM_DCR_DBA_1 | TIM_DCR_DBA_0)
#define TIM_DMABase_CCMR3                  (TIM_DCR_DBA_4 | TIM_DCR_DBA_2)
#define TIM_DMABase_CCR5                   (TIM_DCR_DBA_4 | TIM_DCR_DBA_2 | TIM_DCR_DBA_0)
#define TIM_DMABase_CCR6                   (TIM_DCR_DBA_4 | TIM_DCR_DBA_2 | TIM_DCR_DBA_1)
#define IS_TIM_DMA_BASE(BASE) (((BASE) == TIM_DMABase_CR1) || \
                               ((BASE) == TIM_DMABase_CR2) || \
                               ((BASE) == TIM_DMABase_SMCR) || \
                               ((BASE) == TIM_DMABase_DIER) || \
                               ((BASE) == TIM_DMABase_SR) || \
                               ((BASE) == TIM_DMABase_EGR) || \
                               ((BASE) == TIM_DMABase_CCMR1) || \
                               ((BASE) == TIM_DMABase_CCMR2) || \
                               ((BASE) == TIM_DMABase_CCER) || \
                               ((BASE) == TIM_DMABase_CNT) || \
                               ((BASE) == TIM_DMABase_PSC) || \
                               ((BASE) == TIM_DMABase_ARR) || \
                               ((BASE) == TIM_DMABase_RCR) || \
                               ((BASE) == TIM_DMABase_CCR1) || \
                               ((BASE) == TIM_DMABase_CCR2) || \
                               ((BASE) == TIM_DMABase_CCR3) || \
                               ((BASE) == TIM_DMABase_CCR4) || \
                               ((BASE) == TIM_DMABase_BDTR) || \
                               ((BASE) == TIM_DMABase_DCR) || \
                               ((BASE) == TIM_DMABase_OR) || \
                               ((BASE) == TIM_DMABase_CCMR3) || \
                               ((BASE) == TIM_DMABase_CCR5) || \
                               ((BASE) == TIM_DMABase_CCR6))                     
/**
  * @}
  */ 

/** @defgroup TIM_DMA_Burst_Length 
  * @{
  */

#define TIM_DMABurstLength_1Transfer           (0x00000000)
#define TIM_DMABurstLength_2Transfers          (TIM_DCR_DBL_0)
#define TIM_DMABurstLength_3Transfers          (TIM_DCR_DBL_1)
#define TIM_DMABurstLength_4Transfers          (TIM_DCR_DBL_1 | TIM_DCR_DBL_0)
#define TIM_DMABurstLength_5Transfers          (TIM_DCR_DBL_2)
#define TIM_DMABurstLength_6Transfers          (TIM_DCR_DBL_2 | TIM_DCR_DBL_0)
#define TIM_DMABurstLength_7Transfers          (TIM_DCR_DBL_2 | TIM_DCR_DBL_1)
#define TIM_DMABurstLength_8Transfers          (TIM_DCR_DBL_2 | TIM_DCR_DBL_1 | TIM_DCR_DBL_0)
#define TIM_DMABurstLength_9Transfers          (TIM_DCR_DBL_3)
#define TIM_DMABurstLength_10Transfers         (TIM_DCR_DBL_3 | TIM_DCR_DBL_0)
#define TIM_DMABurstLength_11Transfers         (TIM_DCR_DBL_3 | TIM_DCR_DBL_1)
#define TIM_DMABurstLength_12Transfers         (TIM_DCR_DBL_3 | TIM_DCR_DBL_1 | TIM_DCR_DBL_0)
#define TIM_DMABurstLength_13Transfers         (TIM_DCR_DBL_3 | TIM_DCR_DBL_2)
#define TIM_DMABurstLength_14Transfers         (TIM_DCR_DBL_3 | TIM_DCR_DBL_2 | TIM_DCR_DBL_0)
#define TIM_DMABurstLength_15Transfers         (TIM_DCR_DBL_3 | TIM_DCR_DBL_2 | TIM_DCR_DBL_1)
#define TIM_DMABurstLength_16Transfers         (TIM_DCR_DBL_3 | TIM_DCR_DBL_2 | TIM_DCR_DBL_1 | TIM_DCR_DBL_0)
#define TIM_DMABurstLength_17Transfers         (TIM_DCR_DBL_4)
#define TIM_DMABurstLength_18Transfers         (TIM_DCR_DBL_4 | TIM_DCR_DBL_0)
#define IS_TIM_DMA_LENGTH(LENGTH) (((LENGTH) == TIM_DMABurstLength_1Transfer) || \
                                   ((LENGTH) == TIM_DMABurstLength_2Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_3Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_4Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_5Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_6Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_7Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_8Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_9Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_10Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_11Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_12Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_13Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_14Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_15Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_16Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_17Transfers) || \
                                   ((LENGTH) == TIM_DMABurstLength_18Transfers))
/**
  * @}
  */ 

