g4klx/MMDVM/STM32F7XX_Lib/STM32F7xx_StdPeriph_Driver/inc/stm32f7xx_tim.h
/** @defgroup TIM_DMA_sources 
  * @{
  */

#define TIM_DMA_Update                     (TIM_DIER_UDE)
#define TIM_DMA_CC1                        (TIM_DIER_CC1DE)
#define TIM_DMA_CC2                        (TIM_DIER_CC2DE)
#define TIM_DMA_CC3                        (TIM_DIER_CC3DE)
#define TIM_DMA_CC4                        (TIM_DIER_CC4DE)
#define TIM_DMA_COM                        (TIM_DIER_COMDE)
#define TIM_DMA_Trigger                    (TIM_DIER_TDE)
#define IS_TIM_DMA_SOURCE(SOURCE) ((((SOURCE) & 0xFFFF80FF) == 0x00000000) && ((SOURCE) != 0x00000000))
/**
  * @}
  */ 

/** @defgroup TIM_External_Trigger_Prescaler 
  * @{
  */

#define TIM_ExtTRGPSC_OFF                  ((uint32_t)0x0000)
#define TIM_ExtTRGPSC_DIV2                 (TIM_SMCR_ETPS_0)
#define TIM_ExtTRGPSC_DIV4                 (TIM_SMCR_ETPS_1)
#define TIM_ExtTRGPSC_DIV8                 (TIM_SMCR_ETPS)
#define IS_TIM_EXT_PRESCALER(PRESCALER) (((PRESCALER) == TIM_ExtTRGPSC_OFF) || \
                                         ((PRESCALER) == TIM_ExtTRGPSC_DIV2) || \
                                         ((PRESCALER) == TIM_ExtTRGPSC_DIV4) || \
                                         ((PRESCALER) == TIM_ExtTRGPSC_DIV8))
/**
  * @}
  */ 

/** @defgroup TIM_Internal_Trigger_Selection 
  * @{
  */

#define TIM_TS_ITR0                        ((uint32_t)0x0000)
#define TIM_TS_ITR1                        (TIM_SMCR_TS_0)
#define TIM_TS_ITR2                        (TIM_SMCR_TS_1)
#define TIM_TS_ITR3                        (TIM_SMCR_TS_1 | TIM_SMCR_TS_0)
#define TIM_TS_TI1F_ED                     (TIM_SMCR_TS_2)
#define TIM_TS_TI1FP1                      (TIM_SMCR_TS_2 | TIM_SMCR_TS_0)
#define TIM_TS_TI2FP2                      (TIM_SMCR_TS_2 | TIM_SMCR_TS_1)
#define TIM_TS_ETRF                        (TIM_SMCR_TS_2 | TIM_SMCR_TS_1 | TIM_SMCR_TS_0)
#define IS_TIM_TRIGGER_SELECTION(SELECTION) (((SELECTION) == TIM_TS_ITR0) || \
                                             ((SELECTION) == TIM_TS_ITR1) || \
                                             ((SELECTION) == TIM_TS_ITR2) || \
                                             ((SELECTION) == TIM_TS_ITR3) || \
                                             ((SELECTION) == TIM_TS_TI1F_ED) || \
                                             ((SELECTION) == TIM_TS_TI1FP1) || \
                                             ((SELECTION) == TIM_TS_TI2FP2) || \
                                             ((SELECTION) == TIM_TS_ETRF))
#define IS_TIM_INTERNAL_TRIGGER_SELECTION(SELECTION) (((SELECTION) == TIM_TS_ITR0) || \
                                                      ((SELECTION) == TIM_TS_ITR1) || \
                                                      ((SELECTION) == TIM_TS_ITR2) || \
                                                      ((SELECTION) == TIM_TS_ITR3))
/**
  * @}
  */ 

/** @defgroup TIM_TIx_External_Clock_Source 
  * @{
  */

#define TIM_TIxExternalCLK1Source_TI1      (TIM_SMCR_TS_2 | TIM_SMCR_TS_0)
#define TIM_TIxExternalCLK1Source_TI2      (TIM_SMCR_TS_2 | TIM_SMCR_TS_1)
#define TIM_TIxExternalCLK1Source_TI1ED    (TIM_SMCR_TS_2)

/**
  * @}
  */ 

/** @defgroup TIM_External_Trigger_Polarity 
  * @{
  */ 
#define TIM_ExtTRGPolarity_Inverted        (TIM_SMCR_ETP)
#define TIM_ExtTRGPolarity_NonInverted     ((uint32_t)0x0000)
#define IS_TIM_EXT_POLARITY(POLARITY) (((POLARITY) == TIM_ExtTRGPolarity_Inverted) || \
                                       ((POLARITY) == TIM_ExtTRGPolarity_NonInverted))
/**
  * @}
  */










/** @defgroup TIM_Prescaler_Reload_Mode 
  * @{
  */

#define TIM_PSCReloadMode_Update           ((uint32_t)0x0000)
#define TIM_PSCReloadMode_Immediate        (TIM_EGR_UG)
#define IS_TIM_PRESCALER_RELOAD(RELOAD) (((RELOAD) == TIM_PSCReloadMode_Update) || \
                                         ((RELOAD) == TIM_PSCReloadMode_Immediate))
/**
  * @}
  */ 

/** @defgroup TIM_Forced_Action 
  * @{
  */

#define TIM_ForcedAction_Active            ((uint32_t)TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_0)
#define TIM_ForcedAction_InActive          ((uint32_t)TIM_CCMR1_OC1M_2)
#define IS_TIM_FORCED_ACTION(ACTION) (((ACTION) == TIM_ForcedAction_Active) || \
                                      ((ACTION) == TIM_ForcedAction_InActive))
/**
  * @}
  */ 

/** @defgroup TIM_Encoder_Mode 
  * @{
  */

#define TIM_EncoderMode_TI1                (TIM_SMCR_SMS_0)
#define TIM_EncoderMode_TI2                (TIM_SMCR_SMS_1)
#define TIM_EncoderMode_TI12               (TIM_SMCR_SMS_1 | TIM_SMCR_SMS_0)
#define IS_TIM_ENCODER_MODE(MODE) (((MODE) == TIM_EncoderMode_TI1) || \
                                   ((MODE) == TIM_EncoderMode_TI2) || \
                                   ((MODE) == TIM_EncoderMode_TI12))
/**
  * @}
  */ 

/** @defgroup TIM_Event_Source 
  * @{
  */

#define TIM_EventSource_Update             (TIM_EGR_UG)
#define TIM_EventSource_CC1                (TIM_EGR_CC1G)
#define TIM_EventSource_CC2                (TIM_EGR_CC2G)
#define TIM_EventSource_CC3                (TIM_EGR_CC3G)
#define TIM_EventSource_CC4                (TIM_EGR_CC4G)
#define TIM_EventSource_COM                (TIM_EGR_COMG)
#define TIM_EventSource_Trigger            (TIM_EGR_TG)
#define TIM_EventSource_Break              (TIM_EGR_BG)
#define TIM_EventSource_Break2             (TIM_EGR_B2G)
#define IS_TIM_EVENT_SOURCE(SOURCE) ((((SOURCE) & 0xFFFFFE00) == 0x00000000) && ((SOURCE) != 0x00000000))
  
/**
  * @}
  */ 

/** @defgroup TIM_Update_Source 
  * @{
  */

#define TIM_UpdateSource_Global            ((uint16_t)0x0000) /*!< Source of update is the counter overflow/underflow
                                                                   or the setting of UG bit, or an update generation
                                                                   through the slave mode controller. */
#define TIM_UpdateSource_Regular           ((uint16_t)0x0001) /*!< Source of update is counter overflow/underflow. */
#define IS_TIM_UPDATE_SOURCE(SOURCE) (((SOURCE) == TIM_UpdateSource_Global) || \
                                      ((SOURCE) == TIM_UpdateSource_Regular))
/**
  * @}
  */

