g4klx/MMDVM/STM32F7XX_Lib/STM32F7xx_StdPeriph_Driver/inc/stm32f7xx_tim.h
/** @defgroup TIM_Output_Compare_Preload_State 
  * @{
  */

#define TIM_OCPreload_Enable               ((uint16_t)0x0008)
#define TIM_OCPreload_Disable              ((uint16_t)0x0000)
#define IS_TIM_OCPRELOAD_STATE(STATE) (((STATE) == TIM_OCPreload_Enable) || \
                                       ((STATE) == TIM_OCPreload_Disable))
/**
  * @}
  */ 

/** @defgroup TIM_Output_Compare_Fast_State 
  * @{
  */

#define TIM_OCFast_Enable                  ((uint16_t)0x0004)
#define TIM_OCFast_Disable                 ((uint16_t)0x0000)
#define IS_TIM_OCFAST_STATE(STATE) (((STATE) == TIM_OCFast_Enable) || \
                                    ((STATE) == TIM_OCFast_Disable))
                                     
/**
  * @}
  */ 

/** @defgroup TIM_Output_Compare_Clear_State 
  * @{
  */

#define TIM_OCClear_Enable                 ((uint16_t)0x0080)
#define TIM_OCClear_Disable                ((uint16_t)0x0000)
#define IS_TIM_OCCLEAR_STATE(STATE) (((STATE) == TIM_OCClear_Enable) || \
                                     ((STATE) == TIM_OCClear_Disable))
/**
  * @}
  */ 

/** @defgroup TIM_Trigger_Output_Source 
  * @{
  */

#define TIM_TRGOSource_Reset               ((uint32_t)0x0000)
#define TIM_TRGOSource_Enable              (TIM_CR2_MMS_0)
#define TIM_TRGOSource_Update              (TIM_CR2_MMS_1)
#define TIM_TRGOSource_OC1                 ((TIM_CR2_MMS_1 | TIM_CR2_MMS_0)) 
#define TIM_TRGOSource_OC1Ref              (TIM_CR2_MMS_2)
#define TIM_TRGOSource_OC2Ref              ((TIM_CR2_MMS_2 | TIM_CR2_MMS_0))
#define TIM_TRGOSource_OC3Ref              ((TIM_CR2_MMS_2 | TIM_CR2_MMS_1))
#define TIM_TRGOSource_OC4Ref              ((TIM_CR2_MMS_2 | TIM_CR2_MMS_1 | TIM_CR2_MMS_0))
#define IS_TIM_TRGO_SOURCE(SOURCE) (((SOURCE) == TIM_TRGOSource_Reset) || \
                                    ((SOURCE) == TIM_TRGOSource_Enable) || \
                                    ((SOURCE) == TIM_TRGOSource_Update) || \
                                    ((SOURCE) == TIM_TRGOSource_OC1) || \
                                    ((SOURCE) == TIM_TRGOSource_OC1Ref) || \
                                    ((SOURCE) == TIM_TRGOSource_OC2Ref) || \
                                    ((SOURCE) == TIM_TRGOSource_OC3Ref) || \
                                    ((SOURCE) == TIM_TRGOSource_OC4Ref))


#define TIM_TRGO2Source_Reset                             ((uint32_t)0x00000000)
#define TIM_TRGO2Source_Enable                            ((uint32_t)(TIM_CR2_MMS2_0))
#define TIM_TRGO2Source_Update                            ((uint32_t)(TIM_CR2_MMS2_1))
#define TIM_TRGO2Source_OC1                               ((uint32_t)(TIM_CR2_MMS2_1 | TIM_CR2_MMS2_0))
#define TIM_TRGO2Source_OC1Ref                            ((uint32_t)(TIM_CR2_MMS2_2))
#define TIM_TRGO2Source_OC2Ref                            ((uint32_t)(TIM_CR2_MMS2_2 | TIM_CR2_MMS2_0))
#define TIM_TRGO2Source_OC3Ref                            ((uint32_t)(TIM_CR2_MMS2_2 | TIM_CR2_MMS2_1))
#define TIM_TRGO2Source_OC4Ref                            ((uint32_t)(TIM_CR2_MMS2_2 | TIM_CR2_MMS2_1 | TIM_CR2_MMS2_0))
#define TIM_TRGO2Source_OC5Ref                            ((uint32_t)(TIM_CR2_MMS2_3))
#define TIM_TRGO2Source_OC6Ref                            ((uint32_t)(TIM_CR2_MMS2_3 | TIM_CR2_MMS2_0))
#define TIM_TRGO2Source_OC4Ref_RisingFalling              ((uint32_t)(TIM_CR2_MMS2_3 | TIM_CR2_MMS2_1))
#define TIM_TRGO2Source_OC6Ref_RisingFalling              ((uint32_t)(TIM_CR2_MMS2_3 | TIM_CR2_MMS2_1 | TIM_CR2_MMS2_0))
#define TIM_TRGO2Source_OC4RefRising_OC6RefRising         ((uint32_t)(TIM_CR2_MMS2_3 | TIM_CR2_MMS2_2))
#define TIM_TRGO2Source_OC4RefRising_OC6RefFalling        ((uint32_t)(TIM_CR2_MMS2_3 | TIM_CR2_MMS2_2 | TIM_CR2_MMS2_0))
#define TIM_TRGO2Source_OC5RefRising_OC6RefRising         ((uint32_t)(TIM_CR2_MMS2_3 | TIM_CR2_MMS2_2 |TIM_CR2_MMS2_1))
#define TIM_TRGO2Source_OC5RefRising_OC6RefFalling        ((uint32_t)(TIM_CR2_MMS2_3 | TIM_CR2_MMS2_2 | TIM_CR2_MMS2_1 | TIM_CR2_MMS2_0))
#define IS_TIM_TRGO2_SOURCE(SOURCE) (((SOURCE) == TIM_TRGO2Source_Reset) || \
                                     ((SOURCE) == TIM_TRGO2Source_Enable) || \
                                     ((SOURCE) == TIM_TRGO2Source_Update) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC1) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC1Ref) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC2Ref) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC3Ref) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC4Ref) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC5Ref) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC6Ref) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC4Ref_RisingFalling) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC6Ref_RisingFalling) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC4RefRising_OC6RefRising) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC4RefRising_OC6RefFalling) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC5RefRising_OC6RefRising) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC5RefRising_OC6RefFalling))
/**
  * @}
  */ 

/** @defgroup TIM_Slave_Mode 
  * @{
  */
#define TIM_SlaveMode_Disable                     ((uint32_t)0x0000)
#define TIM_SlaveMode_Reset                       (TIM_SMCR_SMS_2)
#define TIM_SlaveMode_Gated                       (TIM_SMCR_SMS_2 | TIM_SMCR_SMS_0)
#define TIM_SlaveMode_Trigger                     (TIM_SMCR_SMS_2 | TIM_SMCR_SMS_1)
#define TIM_SlaveMode_External1                   (TIM_SMCR_SMS_2 | TIM_SMCR_SMS_1 | TIM_SMCR_SMS_0)
#define TIM_SlaveMode_Combined_ResetTrigger       (TIM_SMCR_SMS_3)
#define IS_TIM_SLAVE_MODE(MODE) (((MODE) == TIM_SlaveMode_Reset) || \
                                 ((MODE) == TIM_SlaveMode_Gated) || \
                                 ((MODE) == TIM_SlaveMode_Trigger) || \
                                 ((MODE) == TIM_SlaveMode_External1) || \
                                 ((MODE) == TIM_SlaveMode_Combined_ResetTrigger))
/**
  * @}
  */ 

/** @defgroup TIM_Master_Slave_Mode 
  * @{
  */

#define TIM_MasterSlaveMode_Enable         (TIM_SMCR_MSM)
#define TIM_MasterSlaveMode_Disable        ((uint32_t)0x0000)
#define IS_TIM_MSM_STATE(STATE) (((STATE) == TIM_MasterSlaveMode_Enable) || \
                                 ((STATE) == TIM_MasterSlaveMode_Disable))
/**
  * @}
  */ 

